import 'dart:convert';

import 'package:http/http.dart' as http;

class Res {
  static Future<http.Response> fetchTest() async {
    var res = await http.get('http://shahidchegini.ir/app_kabireh/test.php');
    if(res.statusCode == 200){
      return json.decode(res.body);
    } else {
      throw Exception('Failed to load test');
    }
  }


  static Future<dynamic> fetchGonahImageUrls(int gonahId) async {
    return fetchGonahUrls('imgs', gonahId);
  }
  static Future<dynamic> fetchGonahVideoUrls(int gonahId) async {
    return fetchGonahUrls('videos', gonahId);
  }
  static Future<dynamic> fetchGonahUrls(String type, int gonahId) async {
    var uri = Uri.http("shahidchegini.ir", "/app_kabireh/test.php", {'gonahId':gonahId.toString(), 'type':type});
    var res = await http.get(uri);
    if(res.statusCode == 200){
      return json.decode(res.body);
    } else {
      throw Exception('Failed to load test');
    }
  }

  static ghonaha () {
    return ["تهمت", "دروغ"];
  }

//  static manbaha(){
//    return [
//      {
//        "title": "داستان راستان",
//        "author": "شهید دستغیب",
//        "publisher": "شیرازیون",
//        "img_url": "1.jpg"
//      },
//      {
//        "title": "داستان دوم",
//        "author": "حسن شیبانی",
//        "publisher": "کرمان نشر",
//        "img_url": "2.jpg"
//      }
//    ];
//  }

  static var gonahExample = """
#مقدمه
دروغ گویی یک صفت ناپسند است که بعضی از کودکان و بزرگسالان بدان مبتلا هستند و در میان بعضی چنان شایع است که گویی به صورت عادت تلقی می شود .

اکثر والدین از این امر شکایت دارند و علی رغم این که تمام امکانات خود را برای تربیت صحیح فرزندشان بکار برده اند و برای راست گویی آنان از هیچ کوششی دریغ نورزیده اند، با این وجود، فرزندشان دروغ می گوید . باید توجه داشت که این لغزش از دوران کودکی پایه گذاری شده است; زیرا وقتی کودک در روزهای اول زندگی توانایی سخن گفتن را پیدا می کند و قادر به حرف زدن می شود، حتی اگر دروغ بگوید، چون سخن او برای والدین شیرین است، در نتیجه، با خنده و شادی از او استقبال کرده و او را مورد تشویق قرار می دهند; غافل از این که همین امر موجب رشد این نابهنجاری در کودک می شود و بدین سان شخصیت کودک شکل می گیرد .

#دروغ گویی فطری است یا اکتسابی؟
هیچ انسانی فطرتا دروغ گو نیست . اودروغ گویی را از محیط خود، یعنی خانواده، مدرسه و بطور کلی اجتماعی که در آن زندگی می کند، یاد می گیرد . تحقیقات نشان می دهد که کودکان ابتدا این عمل را از والدین و اطرافیان خود که با آنها زندگی می کنند و سپس از دوستان و دیگر افراد اجتماع که با آنها برخورد دارند، یاد می گیرند .

حضرت علی (علیه السلام) در این زمینه می فرماید: «قلب کودک همانند زمین بکر و آماده ای است که هر چه در آن کاشته شود، پرورش می یابد» . و دروغ بذری است که در این زمین حاصلخیز بوسیله اطرافیان کاشته می شود و با آبیاری و پرورش مناسب رشد می کند تا حدی که گاهی به صورت یک درخت تنومند درمی آید و از بین بردن آن زحمت های زیادی می طلبد . بنابراین دروغ گویی امری فطری نیست .

#زمان شروع دروغ گویی
یافته های روان شناسان بر این نکته تاکید دارد که گفته های کودکان زیر 5 یا 6 سال، بیشتر جنبه خیالبافی دارد . آنها اغلب احساسات و تخیلات خود را درباره پدیده های اطرافشان بیان می دارند; زیرا کودکان در این سنین در دنیای تصور و خیال زندگی می کنند و بدین سان اندیشه ها، رؤیاها و افکار خود را شکل می دهند، حتی اشیاء بی جان را جاندار می پندارند . برای مثال، کودک، سوار بر تکه چوبی چنین وانمود می کند که مشغول اسب سواری است . این کودکان حوادثی را که با آن مواجه شده اند، بسیار بزرگتر از آن حد و اندازه خود بیان می کنند . همچنین باید توجه داشت که کودک زیر 5 سال از چیزها یا کارهای خوب وبد درک بالایی ندارد; به طوری که نمی تواند به آسانی بین آنها فرق بگذارد .

دروغ گویی در کودکان، از 5 یا 6 سالگی به بعد شروع می شود; زیرا از نظر ذهنی آنهابه مرحله ای می رسند که بتدریج می توانند سخن راست را از دروغ تشخیص دهند . از این سن، صفت دروغ گویی در بعضی از کودکان بتدریج شکل می گیرد و گاهی آن قدر تشدید می شود که به صورت مرض در آمده و بعدها جزیی از شخصیت بزرگسالی آنان محسوب می شود . در واقع دروغ گویی از کودکی به تدریج در نهاد کودک رسوخ کرده و در صورت تداوم و عدم وجود مانع، به شکل یک صفت در بزرگ سالی نمود پیدا می کند .

#پیامدهای دروغ گویی
دروغ گویی مانند سایر بیماری های روانی و عاطفی، ابتدا از یک مساله ساده کوچک آغاز می شود و چنان چه به موقع درمان نشود، به یک بیماری روحی تبدیل می شود که مشکلات بسیاری را برای فرد مبتلا و دیگران فراهم می سازد . از نظر روانی، دروغ گویی برقرار کردن نوعی رابطه بیمار گونه با دیگران است که علاوه بر شخص، دیگران را نیز دچار ناراحتی و مشکل می کند . دروغ گویی عامل اصلی فسادهای دیگر است، به طوری که شاید بتوان گفت کلید ورود به سایر فسادهاست . «در کنفرانس سراسری آموزش و پرورش آمریکا در سانفرانسیسکو گفته شد، تا وقتی که مدارس آمریکا نتوانند نسلی که دروغ نگوید، افترا نزند، قانون نشکند و به حقوق دیگران تجاوز نکند، به وجود آورند، نمی توانند خود را موفق بدانند . تدریس، خواندن، نوشتن، دانش، و هنر کافی نیست و نمی تواند هدف اصلی آموزش و پرورش باشد، بلکه مهم ترین وظیفه آموزش و پرورش، تدریس دروغ نگفتن است که عامل اصلی تمام فسادهاست .» (1)

#برخی از عوارض و پیامدهای دروغ گویی عبارت است از:

1- بی اعتباری دروغ گو
زندگی در اجتماع بر اساس نوعی اعتماد نسبی دو جانبه استوار است . دروغ به این اعتماد لطمه می زند و موجب اختلال در روابط بین افراد شده و بدبینی را بین آنان پدید می آورد . همچنین فاش شدن دروغ شخص مبتلا، باعث می شود تا آبروی او بریزد و ارزش و اعتبار خود را از دست بدهد . در این باره امام جعفر صادق (علیه السلام) از قول حضرت علی (علیه السلام) می فرماید: «هر کس زیاد دروغ بگوید، ارزش و اعتبارش بر باد می رود .» (2)

حضرت علی (علیه السلام) می فرماید: «سزاوار است که مسلمانان از دوستی و برادری با دروغ گو اجتناب کنند; زیرا او آنقدر دروغ می گوید، که راستش را هم باور نمی کنند .» (3)

2- از بین رفتن ایمان دروغ گو
کسانی که به گفته های یک دروغ گو اعتماد می کنند و آن را می پذیرند به گمراهی کشیده خواهند شد . این امر در مسائل فکری و اعتقادی موجب تباهی ایمان و عقیده افراد می گردد . همچنین دروغگو برای رسیدن به هدف و مطلوب خویش، دروغ را ابزار مؤثر در نتیجه کار می داند و این همان شرک خفی است و نشان گر ضعف ایمان دروغگو نسبت به اثر خداوند تعالی بر امور است . فلذا امام محمد باقر (علیه السلام) می فرماید: «دروغ خانه ایمان را ویران می سازد .» (4)

3- دردسر زحمت برای دروغ گو و دیگران
دروغگو همواره با دروغ علاوه بر این که خود را به زحمت می اندازد، دیگران را نیز دچار مشکل می کند . در یکی از روزنامه های صبح، مطلبی تحت عنوان «دردسر آفرینی دوست دروغگو» بدین شرح آمده است:

«رستم به تازگی با فرامرز دوست شده بود . در یک مهمانی برای آن که از قافله عقب نماند، به دروغ گفت که من، سوار کار ماهری هستم . مهمانان و دوستان که سر شوق آمده بودند، این دو را به سوارکاری در پارک جنگلی دعوت کردند . رستم بیچاره هم که در مقابل عمل انجام شده قرار گرفته بود، به ناچار تسلیم شد و هنگامی که پا در رکاب اسب گذاشت، دچار سانحه شد . او در همان جهش اول اسب، به زمین افتاد و به علت گیر کردن پایش در رکاب، دهها متر روی زمین کشیده شد . سرانجام در بیمارستان معلوم شد که رستم دچار شکستگی زانو، شانه و دنده شده است .» (5)

4- مانعی برای خودشناسی
افراد دروغگو، غالبا خودشان را غیر از آنچه هستند، نشان می دهند . این امر که آنها واقعا دارای توانایی هایی می باشند، بر اثر تکرار دروغگویی بر آنان مشتبه می شود . از این رو، به مرور زمان دروغگویی حجابی برای خودشناسی آنان می شود .

#علل دروغگویی
دروغگویی از هر نوع، دارای علت هایی است و برای درمان آن لازم است ابتدا، علت های به وجود آورنده این عادت شناخته شده، سپس درمان شود . بعضی از این علت ها به شرح زیر است:

الف) ترس
ترس از مجازات، خدشه دار شدن آبرو، یا هر چیز دیگر، یکی از مهم ترین علل دروغگویی در کودکان و بزرگسالان است . در این خصوص، روی کودکان شش تا چهارده ساله تحقیقاتی صورت گرفته، که نتایج آن در جدول زیر آمده است . (6)

علت / درصد

ترس / 71%

غرور یا خودخواهی / 17%

آزار گری و شیطنت / 10%

دیگر خواهی (نوع دوستی) / 2%

همانطور که از این جدول برمی آید، ترس بیشترین درصد دروغگویی در کودکان را تشکیل می دهد; زیرا اگر کودک بداند چنانچه به خطای خود اعتراف کند، مورد سرزنش، تحقیر و احیانا تنبیه قرار خواهد گرفت، به ناچار برای حفظ آبروی خود به دروغ پناه می برد . این امر، خصوصا در خانواده هایی رایج است که معتقدند تحقیر، تنبیه و رفتارهای خشونت آمیز تنها راه جلوگیری از انحراف کودک است . در حالی که این روش ها، نه تنها مؤثر نیست، بلکه موجب می شود ترس کودک به تدریج از بین برود و او رفتارهای خلاف خود را با جرات بیشتری انجام دهد .

«ژان پیاژه » روان شناس سوئیسی در این باره می نویسد: «دروغ برای کودک یک نوع فرار از حقیقت است . اگر کودک خود را در اجتماع و خانواده، فرد محترمی بداند و آزادی عمل داشته باشد، برای چه با دروغ گفتن به خانواده اش خیانت کند . کودک با سختگیری های زیاد، از افراد خانواده فاصله می گیرد و خود را از آن ها جدا می داند; زیرا می بیند اگر راست بگوید، او را تنبیه می کنند . . . .»

اگر والدین یا مربیان از خلاف های جزئی کودکان چشم پوشی کرده و با مهربانی و صمیمیت اشتباهات شان را به آنها گوشزد کنند، در این صورت، کودکان هیچ گاه به دروغ گویی متوسل نمی شوند .

ب) اجبار
اگر با اجبار از کودکی خواسته شود کاری را که مورد علاقه اش نیست، انجام دهد، یا آن کار را سرسری انجام می دهد، یا به دروغ وانمود می کند که آن را انجام داده است و اگر این فشار واجبار بیش از حد باشد، کودک در غیاب والدین یا مربیان ممکن است بر خلاف دستورات آنها عمل نماید که این امر باعث می شود که او به طرف فساد کشیده شود .

باید برای انجام هر کاری که از کودک می خواهیم، پیش از آن که به اجبار و تهدید متوسل شویم، میل، رغبت و انگیزه ای در او ایجاد کنیم تا با لذت و احساس رضایت به انجام آن کار بپردازد .

ج) الگوهای نامناسب
اگر در خانواده ای، والدین یا کسانی که با کودک زندگی می کنند، دروغ بگویند، ناخودآگاه و به طور غیر مستقیم زمینه دروغ گویی را برای کودک فراهم ساخته اند، در واقع اولین درس دروغ گویی را کودک از آنها خواهد آموخت; زیرا خانواده اولین محیط تربیتی کودک محسوب می شود و گفتار، رفتار و به طور کلی طرز زندگی والدین در تربیت فرزندان بسیار مؤثر است . فرزندان بدون توجه و اراده، بر اساس همانند سازی با اطرافیان، آن چه را که می بینند و می شنوند، تقلید می کنند و یاد می گیرند . تلاش این خانواده ها برای جلوگیری از دروغ گویی بی اثر است; زیرا تا والدین خود اصلاح نشوند، هر گونه اقدامی در این زمینه بی اثر خواهد بود .

د) احساس حقارت
کودکی که در خانواده یا محیطهای دیگر، دائما مورد تحقیر، سرزنش، بی اعتنایی و تمسخر قرار می گیرد، از هیچ کوششی برای نشان دادن خود دریغ نمی ورزد . او تلاش می کند تا به هر نحوی که ممکن است توجه اعضای خانواده و اطرافیان را به خود جلب کند . از این رو، به رفتارهای مختلفی از جمله دروغ گویی دست می زند; زیرا این امر سبب توجه دیگران به او خواهد شد . این کودکان دچار ضعف شخصیت هستند و احساس حقارت دارند . آنها برای رهایی از این احساس و ابراز وجود، به غلو در مورد خود می پردازند و اغلب درباره خود، دیگران و حوادث، دروغ های باورنکردنی می گویند . همچنین وعده هایی می دهند که قدرت انجام آن را ندارند . البته تمام این کارها را برای این انجام می دهند تا در حضور دیگران مورد تمجید و تقدیر قرار گیرند; زیرا این عمل سبب می شود تا در ذهن خود احساس قدرت کنند . همچنین عده ای از کودکان یا افراد به دلیل داشتن عیوب جسمی، نام نامناسب (خود یا خانواده)، وضعیت نامطلوب خانوادگی و . . . احساس شرمساری می کنند و چون می ترسند مورد تمسخر واقع شوند، به دروغ پناه می برند . پیامبر بزرگوار اسلام (صلی الله علیه و آله) می فرماید: «دروغ گو، دروغ نمی گوید، مگر به سبب حقارتی که در نفس خود احساس می کند .» (7)

باید به شخصیت کودک احترام گذاشت و او را مورد توجه و محبت قرار داد . همچنین شایسته است کودکان را با ارزش های واقعی و انسانی آشنا کرد تا دست کم مسائل جزئی و بی ارزش موجب دروغ گویی و انحراف آنان نشود .

ه) نیازهای ارضا نشده
عده ای از روان شناسان معتقدند که بعضی از دروغ ها نشان دهنده نیازها و تمایلات ارضا نشده است; زیرا بعضی از دروغ هایی که ما را متعجب می کند، از تخیلات سرچشمه می گیرد . دروغ هایی که نشان دهنده حقیقتی می باشند که کم و بیش تغییر یافته است . به هر میزان نیازهای ارضا نشده بیشتر باشد، احساس کمبود در کودک قوی تر است وبرای جبران این احساس، بیشتر به دروغ گویی می پردازد . این امر در خصوص کودکانی که کمتر مورد محبت و توجه والدین قرار می گیرند، بیشتر صادق است . برای مثال:

«پرویز پنج ساله، خواهر دو ساله ای دارد که هر وقت او را تنها می بیند، محکم نیشگونش می گیرد . در نتیجه، خواهرش فریاد می زند . مادرش به محض شنیدن فریاد او، با عجله خود را به آنها می رساند . پرویز طوری رفتار می کند که چیزی از ماجرا نمی داند و به مادرش می گوید: گریه و فریاد خواهرم برای این است که او دختر موذی است، ولی من مهربان و مؤدب هستم . سپس خود را به مادرش نزدیک می کند تا مادرش او را نوازش کند .» (8)

روانکاوان معتقدند که در این جا دروغ و تظاهر، ناخودآگاه با هم تلفیق شده اند و دلیلش هم آن است که تولد خواهر، سبب محرومیت پرویز از محبت مادری شده، در نتیجه، پرویز سعی می کند آن را به هر وسیله ای که شده دوباره بدست آورد . توجه به نیازهای معقول کودک و ارضای مطلوب آن ها، سبب می شود تا کودک کمتر از راه های نادرست نیازهای خود را برآورده سازد و نیازی به دروغ گفتن نداشته باشد .

ادامه دارد . . .

#پی نوشت:

1) روزنامه همشهری، سال اول، شماره 152، تیر 1372، ص 16 .

2) اصول کافی، ج 6، ص 340 .

3) همان، ج 2، ص 36 .

4) ان الکذب هو خراب الایمان » ; همان، ص 339 .

5) روزنامه همشهری، «دردسر آفرینی دروغگو» ، سال اول، شماره 253، 15آبان 1372، ص 20 .

6) بالایان، روان شناسی کودک به زبان ساده، اصفهان، انتشارات مشعل، 1370، ص 52 .

7) مستدرک، جلد 2، ص 100 .

8) محمدحسین سروری، قلمرو روان شناسی، تهران، نشر نکته، 1371، ص 123 .
  """;

}